app/controllers/businesses_controller.rb

  def populate_product_bundles
  	@business = Business.find_by_id(params[:business_id])
  	respond_to do |format|
      format.html
      format.json { render json: { product_bundles: @business.product_bundles.collect{|b| [b.name,b.id]},
                                   business_retail_price: @business.retail_price,
                                   business_discounted_price: @business.discounted_price
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = 3 LIMIT 1
SELECT "product_bundles".* FROM "product_bundles" WHERE "product_bundles"."business_id" = 3