app/controllers/product_bundles_controller.rb

  def index
  	@business = Business.find_by_id(params[:business_id])
    @product_bundles = @business.product_bundles
  	respond_to do |format|
      format.html
      format.json { render json: { product_bundles: @product_bundles.collect{|b| [b.name,b.id]},
                                   retail_price: @product_bundles.first.retail_price,
                                   discounted_price: @product_bundles.first.discounted_price}}
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = 3 LIMIT 1
SELECT "product_bundles".* FROM "product_bundles" WHERE "product_bundles"."business_id" = 3

  def show
    @product_bundle = ProductBundle.find_by_id(params[:id])
---
SELECT "product_bundles".* FROM "product_bundles" WHERE "product_bundles"."id" = 12 LIMIT 1