app/controllers/promotions_controller.rb

  def index
    @promotions = Promotion.all
---
SELECT "promotions".* FROM "promotions"

  def show
    @promotion = Promotion.find(params[:id])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @promotion = Promotion.find(params[:id])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @promotion = Promotion.new(params[:promotion])

    respond_to do |format|
      if @promotion.save
---
INSERT INTO "promotions" ("created_at", "description", "end_date", "name", "start_date", "sub_title", "subject", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @promotion = Promotion.find(params[:id])
    @promotion.start_date = Time.parse(params[:promotion][:start_date])
    @promotion.end_date = Time.parse(params[:promotion][:end_date])

    respond_to do |format|
      if @promotion.update_attributes(params[:promotion])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "promotions" SET "name" = 'Promotion 1', "redemption_detail" = '', "start_date" = '2012-06-23 00:00:00.000000', "end_date" = '2012-07-03 00:00:00.000000', "updated_at" = '2012-06-23 08:31:55.767443' WHERE "promotions"."id" = 1