app/views/promotions/_form.html.erb

SELECT "businesses".* FROM "businesses" WHERE "businesses"."promotion_id" = 1
---
              <div class="controls" data-object-id = "<%=businesses_promotion.object.id%>" >
                <%=businesses_promotion.select :business_id, options_for_select(Business.all.collect{|b| [b.name,b.id]})%>

SELECT "businesses".* FROM "businesses" INNER JOIN "businesses_promotions" ON "businesses"."id" = "businesses_promotions"."business_id" WHERE "businesses_promotions"."promotion_id" = 1
SELECT "product_bundles".* FROM "product_bundles" WHERE "product_bundles"."business_id" = 1
---
              <div class="controls" data-object-id = "<%=businesses_promotion.object.id%>">
                <%=businesses_promotion.select :product_bundle_id, options_for_select(businesses_promotion.object.business.product_bundles.collect{|b| [b.name,b.id]})%>

SELECT "businesses_promotions".* FROM "businesses_promotions" WHERE "businesses_promotions"."promotion_id" = 1 AND "businesses_promotions"."id" IN (1, 2) ORDER BY created_at
SELECT "product_bundles".* FROM "product_bundles" WHERE "product_bundles"."id" = 1 LIMIT 1
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = $1 LIMIT 1  [["id", "1"]]
---
<script type='text/javascript'>
  $(function() {
    promotion.setup({"path" : '<%=product_bundles_path%>'});
    <%@promotion.businesses_promotions.each do |bp|%>
      var currentObject = promotion.businessPromotionSection.find("div[data-object='business-promotion-" + "<%=bp.id%>" + "']");
      currentObject.find(".businesses-select").find("option[value='"+"<%=bp.business.id%>"+"']").attr("selected", "selected");
      currentObject.find(".product-bundles-select").find("option[value='"+"<%=bp.product_bundle.id%>"+"']").attr("selected", "selected");
    <%end%>
  });