app/views/promotions/show.html.erb

SELECT "businesses".* FROM "businesses" INNER JOIN "businesses_promotions" ON "businesses"."id" = "businesses_promotions"."business_id" WHERE "businesses_promotions"."promotion_id" = 1
SELECT "businesses_promotions".* FROM "businesses_promotions" WHERE "businesses_promotions"."promotion_id" = 1 ORDER BY created_at
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = 2 LIMIT 1
---
  <dt><strong>Business/ Product Bundle:</strong></dt>
  <%@promotion.businesses_promotions.each do |businesses_promotion|%>
  <dd><%= [businesses_promotion.business.name, businesses_promotion.product_bundle.name].join("/ ") %></dd>